_posts/2010-08-08-download-videolectures-videos-vlc.html
--- 
layout: post
title: How to download videolectures.net videos with VLC
categories: 
- automation
- shell
---








<p>
<a href="http://videolectures.net/">videolectures.net</a> has very good content but, no good way to download the videos(at least as of now), and sometimes you want to watch them offline, so here's a way to dowload them if you have VLC video player installed.
</p>
<p>
This of course works for all videos that are streamed from an mms:// address and not only the videolectures ones.
</p>
<p>
Btw, found same idea, but using mplayer instead, from <a href="http://measuringmeasures.blogspot.com/2009/12/downloading-from-videolecturesnet.html">bradfordcross here</a>.
</p>

<div class="outline-2" id="outline-container-1">
<h2 id="sec-1">How to </h2>
<div class="outline-text-2" id="text-1">


<p>
Find the mms:// address for the video(from the web page source) and do:
</p>



<pre class="src src-sh">$ /Applications/VLC.app/Contents/MacOS/VLC -I rc mms://velblod2.ijs.si:80/2009/pascal2/mlss09uk_cambridge/mackay_it/mlss09uk_mackay_it_01.wmv --sout ~/Desktop/information-theory.avi
</pre>



<p>
If you are not on a Mac, then you need to update the paths.
</p>
</div>

</div>

<div class="outline-2" id="outline-container-2">
<h2 id="sec-2">Make a bash script from it </h2>
<div class="outline-text-2" id="text-2">


<p>
Its annoying to write all of the above every time you want to download a video, so is worth to make a bash script from it.
</p>
<p>
Create a new file, with content:
</p>



<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">getvideo.sh 
</span>/Applications/VLC.app/Contents/MacOS/VLC -I rc $<span style="color: #a0522d;">1</span> --sout ~/Desktop/$<span style="color: #a0522d;">2</span>.avi vlc://quit;
</pre>


<p>
Note that i added the <i>vlc://quit;</i> at the end, this will make it the script exit when finished.
</p>
<p>
Make it executable and reachable from everywhere:
</p>



<pre class="src src-sh">$ chmod 711 getvideo.sh 
$ ln -s getvideo.sh /usr/bin/getvideo
</pre>



<p>
And use like so:
</p>



<pre class="src src-sh">$ getvideo mms://velblod2.ijs.si:80/2009/pascal2/mlss09uk_cambridge/mackay_it/mlss09uk_mackay_it_01.wmv information-theory
</pre>



</div>

</div>

<div class="outline-2" id="outline-container-3">
<h2 id="sec-3">Converting to mp4 </h2>
<div class="outline-text-2" id="text-3">


<p>
Found from: <a href="http://wiki.videolan.org/Transcode">http://wiki.videolan.org/Transcode</a> a very useful script for this, i've changed a couple of things:
</p>



<pre class="src src-sh"><span style="color: #b22222;">#</span><span style="color: #b22222;">!/bin/</span><span style="color: #7f007f;">bash</span><span style="color: #b22222;">
</span><span style="color: #b22222;">#</span><span style="color: #b22222;">
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">Transcode DVB TV signals to h.264-encoded MP4 files using VLC
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">Wout.Mertens@gmail.com
</span>
<span style="color: #b22222;">#### </span><span style="color: #b22222;">Defaults, please edit for your settings ####
</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">VLC location, here is the Mac OS X example
</span><span style="color: #a0522d;">VLC</span>=<span style="color: #8b2252;">"/Applications/VLC.app/Contents/MacOS/VLC -I rc"</span> 
<span style="color: #b22222;"># </span><span style="color: #b22222;">Other possibilities: (Remove the # to activate)
</span><span style="color: #b22222;">#</span><span style="color: #b22222;">VLC=/usr/bin/vlc
</span><span style="color: #b22222;">#</span><span style="color: #b22222;">VLC=/usr/local/bin/vlc
</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">16:9 or 4:3
</span><span style="color: #a0522d;">aspect</span>=4:3

<span style="color: #b22222;"># </span><span style="color: #b22222;">PAL (Europe) or NTSC (US)
</span><span style="color: #a0522d;">src</span>=PAL

<span style="color: #b22222;"># </span><span style="color: #b22222;">video bitrate
</span><span style="color: #a0522d;">bitrate</span>=1024

<span style="color: #b22222;"># </span><span style="color: #b22222;">audio bitrate
</span><span style="color: #a0522d;">arate</span>=128

<span style="color: #b22222;"># </span><span style="color: #b22222;">cropping?
</span><span style="color: #a0522d;">crop</span>=yes

<span style="color: #b22222;"># </span><span style="color: #b22222;">Deinterlace?
</span><span style="color: #a0522d;">deint</span>=yes

<span style="color: #b22222;">#### </span><span style="color: #b22222;">Program, do not change below this line ####
</span>usage() {
        cat 1&gt;&amp;2 &lt;&lt;EOF<span style="color: #ffa54f;">
Usage: $0 [-swpncC] [-b &lt;rate&gt;] [-a &lt;rate&gt;] &lt;DVB source .mpg&gt;
        -s      4:3 aspect ratio (default=$aspect)
        -w      16:9 aspect ratio
        -p      PAL (720x576) input (default=$src)
        -n      NTSC (720x480) input
        -c      Crop borders (default=$crop)
        -C      Do not crop borders
        -d      Perform de-interlacing (default=$deint)
        -D      Do not perform de-interlacing
        -b      video bitrate kb/s (default=$bitrate)
        -a      audio bitrate kb/s (default=$arate)
EOF
</span>        <span style="color: #7f007f;">exit</span> 1
}

error() {
        <span style="color: #7a378b;">echo</span> <span style="color: #8b2252;">"ERROR: $*"</span> 1&gt;&amp;2
        <span style="color: #7f007f;">exit</span> 2
}

<span style="color: #7f007f;">while </span><span style="color: #7a378b;">getopts</span> <span style="color: #8b2252;">'swpncCb:a:h'</span> opt; <span style="color: #7f007f;">do</span>
        <span style="color: #7f007f;">case</span> $<span style="color: #a0522d;">opt</span><span style="color: #7f007f;"> in</span>
                s) <span style="color: #a0522d;">aspect</span>=4:3 ;;
                w) <span style="color: #a0522d;">aspect</span>=16:9 ;;
                p) <span style="color: #a0522d;">src</span>=PAL ;;
                n) <span style="color: #a0522d;">src</span>=NTSC ;;
                c) <span style="color: #a0522d;">crop</span>=yes ;;
                C) <span style="color: #a0522d;">crop</span>=no ;;
                d) <span style="color: #a0522d;">deint</span>=yes ;;
                D) <span style="color: #a0522d;">deint</span>=no ;;
                b) <span style="color: #a0522d;">bitrate</span>=$<span style="color: #a0522d;">OPTARG</span> ;;
                a) <span style="color: #a0522d;">arate</span>=$<span style="color: #a0522d;">OPTARG</span> ;;
                h) usage ;;
                *) <span style="color: #7a378b;">echo</span> <span style="color: #8b2252;">"Unknown option $opt"</span> 1&gt;&amp;2; usage ;;
        <span style="color: #7f007f;">esac</span>
<span style="color: #7f007f;">done</span>
<span style="color: #7a378b;">shift</span> $(( $<span style="color: #a0522d;">OPTIND</span> - 1 ))

[ $# -ne 1 ] &amp;&amp; usage

<span style="color: #a0522d;">infile</span>=<span style="color: #8b2252;">"$1"</span>
<span style="color: #a0522d;">outfile</span>=${<span style="color: #a0522d;">1</span>%.*}
<span style="color: #7f007f;">case</span> $<span style="color: #a0522d;">outfile</span><span style="color: #7f007f;"> in</span>
        *.mp4|*.MP4) : ;;
        *) <span style="color: #a0522d;">outfile</span>=<span style="color: #8b2252;">"$outfile.mp4"</span> ;;
<span style="color: #7f007f;">esac</span>

[ -r <span style="color: #8b2252;">"$infile"</span> ] || error <span style="color: #8b2252;">"Can't read from $infile"</span>

<span style="color: #7f007f;">case</span> <span style="color: #8b2252;">"$src,$aspect,$crop"</span><span style="color: #7f007f;"> in</span>
        PAL,16:9,yes) <span style="color: #a0522d;">sizestr</span>=<span style="color: #8b2252;">"cropleft=31,cropright=31,croptop=16,cropbottom=16,width=960,height=544"</span> ;;
        PAL,4:3,yes)  <span style="color: #a0522d;">sizestr</span>=<span style="color: #8b2252;">"cropleft=31,cropright=31,croptop=16,cropbottom=16,width=720,height=544"</span> ;;
        NTSC,16:9,yes) <span style="color: #a0522d;">sizestr</span>=<span style="color: #8b2252;">"cropleft=30,cropright=30,croptop=17,cropbottom=17,width=800,height=448"</span> ;;
        NTSC,4:3,yes) <span style="color: #a0522d;">sizestr</span>=<span style="color: #8b2252;">"cropleft=26,cropright=26,croptop=17,cropbottom=17,width=608,height=448"</span> ;;
        PAL,16:9,no) <span style="color: #a0522d;">sizestr</span>=<span style="color: #8b2252;">"width=1024,height=576"</span> ;;
        PAL,4:3,no) <span style="color: #a0522d;">sizestr</span>=<span style="color: #8b2252;">"width=768,height=576"</span> ;;
        NTSC,16:9,no) <span style="color: #a0522d;">sizestr</span>=<span style="color: #8b2252;">"width=800,height=448"</span> ;;
        NTSC,4:3,no) <span style="color: #a0522d;">sizestr</span>=<span style="color: #8b2252;">"width=608,height=448"</span> ;;
        *) error <span style="color: #8b2252;">"Could not handle $src,$aspect,$crop. This shouldn't happen!"</span> ;;
<span style="color: #7f007f;">esac</span>

<span style="color: #7f007f;">if</span> [ <span style="color: #8b2252;">"$deint"</span> = <span style="color: #8b2252;">"yes"</span> ]; <span style="color: #7f007f;">then</span>
        <span style="color: #a0522d;">deintstr</span>=<span style="color: #8b2252;">",deinterlace=enable"</span>
<span style="color: #7f007f;">else</span>
        <span style="color: #a0522d;">deintstr</span>=
<span style="color: #7f007f;">fi</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">Let's do it
</span><span style="color: #7a378b;">echo</span> <span style="color: #8b2252;">"Input file: $infile"</span>
<span style="color: #7a378b;">echo</span> <span style="color: #8b2252;">"Output file: $outfile"</span>
<span style="color: #7a378b;">echo</span> <span style="color: #8b2252;">"Encoding at $bitrate+$arate kb/s, input $src, $aspect, cropping $crop, de-interlace $deint"</span>
<span style="color: #7a378b;">echo</span>
<span style="color: #7a378b;">echo</span> <span style="color: #8b2252;">'&gt;&gt;&gt;'</span> $<span style="color: #a0522d;">VLC</span> -I dummy <span style="color: #8b2252;">"$infile"</span> --sout <span style="color: #8b2252;">"#transcode{$sizestr$deintstr,vcodec=h264,vb=$bitrate,acodec=mp4a,ab=$arate}:standard{mux=mp4,dst=\"$outfile\",access=file}"</span> vlc://quit
<span style="color: #7a378b;">echo</span>
$<span style="color: #a0522d;">VLC</span> -I dummy <span style="color: #8b2252;">"$infile"</span> --sout <span style="color: #8b2252;">"#transcode{$sizestr$deintstr,vcodec=h264,vb=$bitrate,acodec=mp4a,ab=$arate}:standard{mux=mp4,dst=\"$outfile\",access=file}"</span> vlc://quit
</pre>



<p>
You can also make it into a system executable script, like in above instructions. I call it <b>2mp4</b>
</p>
</div>

</div>

<div class="outline-2" id="outline-container-4">
<h2 id="sec-4">A step further </h2>
<div class="outline-text-2" id="text-4">


<p>
Now that we have 2mp4 available then we can update original script, to download + convert to mp4 in one go, like so:
</p>



<pre class="src src-sh"><span style="color: #b22222;"># </span><span style="color: #b22222;">getvideo.sh 
</span>/Applications/VLC.app/Contents/MacOS/VLC -I rc $<span style="color: #a0522d;">1</span> --sout ~/Desktop/$<span style="color: #a0522d;">2</span>.avi vlc://quit;
2mp4 ~/Desktop/$<span style="color: #a0522d;">2</span>.avi;
</pre>


</div>
</div>
<div id="postamble">
<p class="date"> Date: 2010-11-06 19:30:12 EET</p>
</div>
